# Курс знакомство с языком программирования C#

## Лекции

### Лекция 1

Знакомимся с консолью, создаем директорию **/Example001_HelloConsole** и подготавливаем её для написания проекта
```
dotnet new console
```
Для вывода в консоль используется команда:
```
Console.WriteLine("Hello, World!");
/// Так пишется комментарий
```
В процессе и после написания программы чтобы её запустить для выполнения надо выполнить команду:
```
dotnet run
``` 

Делаем запрос у пользователя в терминале , создаем **Example002_HelloUser**
Пишем вопрос:
```
Console.WriteLine("Как Вас зовут?");
```
Делаем запрос:
```
string username = Console.ReadLine();
```
Выводим приветствие:
```
Console.Write("Привет, "); // однострочный вывод (без переноса строки)
Console.WriteLine(username); // с переносом строки
```
// Продолжить...

## Семинары

### Семинар 1

* task1_1: По двум заданным числам проверять является ли первое квадратом второго

* task1_2: Даны два числа. Показать большее и меньшее число

* task1_3: По заданному номеру дня недели вывести его название

* task1_4: Выяснить является ли число чётным

* task1_5: Показать последнюю цифру трёхзначного числа

#### Домашнее задание

* Вывести квадрат числа
* Найти максимальное из трех чисел
* Выяснить является ли число чётным
* Показать последнюю цифру трёхзначного числа
* Показать вторую цифру трёхзначного числа
* Дано число из отрезка [10, 99]. Показать наибольшую цифру числа
* Удалить вторую цифру трёхзначного числа
* Выяснить, кратно ли число заданному, если нет, вывести остаток.
* Найти третью цифру числа или сообщить, что её нет

### Семинар 2

* task2_1: Дано число. Проверить кратно ли оно 7 и 23
* task2_2: Определить номер четверти плоскости, 
в которой находится точка с координатами Х и У, причем X ≠ 0 и Y ≠ 0
* task2_3: Программа проверяет пятизначное число на палиндромом.

#### Домашнее задание

* Показать числа от -N до N
* Показать четные числа от 1 до N
* Дано число обозначающее день недели. Выяснить является номер дня недели выходным
* По двум заданным числам проверять является ли одно квадратом другого
* Определить номер четверти плоскости, 
в которой находится точка с координатами Х и У, причем X ≠ 0 и Y ≠ 0
* Найти расстояние между точками в пространстве 2D/3D

### Семинар 3

## Дополнительные занятия

### Знакомство с языками программирования. Семинар 2.
Дополнительные задачи.

Задача 1. Написать программу, которая определяет, является ли треугольник со сторонами a, b, c равнобедренным.

Задача 2. На вход подаются год, номер месяца и день рождения человека, Определить возраст человека на момент 1 февраля 2022 года.

Задача 3. Иван в январе года открыл счет в банке, вложив 1000 руб. Через каждый месяц размер вклада увеличивается на 1.5% от имеющейся суммы. Определить размер депозита через n месяцев.

Задача 4. Дано натуральное число, в котором все цифры различны. Определить, какая цифра расположена в нем левее: максимальная или минимальная.


### Дополнительные задачи к семинару 3 от Дениса Сапрыкина: 

Знакомство с языками программирования. Семинар 3.
Дополнительные задачи.

Задача 1. На ввод подаётся номер четверти. Создаются 3 случайные точки в этой четверти. Определите самый оптимальный маршрут для торгового менеджера, который выезжает из центра координат.

Задача 2. Даны 4 точки a, b, c, d. Пересекаются ли вектора AB и CD?

Задача 3. Решить задачу 1 для n точек.


Задача 4. Найти в какой четверти лежит точка пересечения из задачи 2 (если вектора пересекаются).

Задача 5. Дан массив средних температур (массив заполняется случайно) за последние 10 лет. На ввод подают номер месяца и год начали и конца.
Определить самые высокие и низкие температуры для лета, осени, зимы и весны в заданном промежутке. Если таких температур нет, сообщить, что определить не удалось.

Задача 6. На вход подаётся число n > 4, указывающее длину пароля. Создайте метод, генерирующий пароль заданной длины. В пароле обязательно использовать цифру, букву и специальный знак.

Задача 7. Из центра координат к точке А(x, y) проведён отрезок АО. Напишите программу, определяющую наименьший угол наклона отрезка AO к оси X.

Задача 8. Массив из ста элементов заполняется случайными числами от 1 до 100. Удалить из массива все элементы, содержащие число 3. Вывести в консоль новый массив и количество удалённых элементов.

## ??? Полезные ссылки ???

Руководство по программированию в C#. Определение представления чис...
Узнайте, как определить, является ли строка допустимым представлением указанного числового типа. Изучите примеры кода и ознакомьтесь с дополнительными ресурсами.
https://docs.microsoft.com/ru-ru/dotnet/csharp/programming-guide/strings/how-to-determine-whether-a-string-represents-a-numeric-value

Ссылочные типы, допускающие значение null
В этой статье представлен обзор ссылочных типов, допускающих значение NULL, добавленных в C# 8.0. Вы узнаете, как эта функция обеспечивает безопасность от исключений, связанных со ссылочными типами, допускающими значение NULL, в новых и существующих проектах.
https://docs.microsoft.com/ru-ru/dotnet/csharp/nullable-references

Репозиторий одногрупника Дмитрия Прудникова
https://github.com/DmitryLantz/repos/tree/master/HomeWorkSeminars 
