// Иван в январе года открыл счет в банке, вложив 1000 руб.
// Через каждый месяц размер вклада увеличивается на 1.5% от имеющейся суммы.
// Определить размер депозита через n месяцев.

Console.WriteLine("Hello, World!");
