// На вход подаются год, номер месяца и день рождения человека,
// Определить возраст человека на момент 1 февраля 2022 года.

Console.WriteLine("Hello, World!");
