// Дано натуральное число, в котором все цифры различны.
// Определить, какая цифра расположена в нем левее: максимальная или минимальная.

Console.WriteLine("Hello, World!");
